Repository: ystk/debian-kbd
Catalog: po/*.po
Languages: ro

source: usage: chvt N
ro: folosire: chvt N

source: %s: unknown option
ro: %s: opþiune necunoscutã

source: %s: deallocating all unused consoles failed
ro: %s: dealocarea tuturor consolelor nefolosite a eºuat

source: %s: 0: illegal VT number
ro: %s: 0: numãr VT ilegal

source: %s: VT 1 is the console and cannot be deallocated
ro: %s: VT 1 este consola ºi nu poate fi dealocatã

source: %s: could not deallocate console %d
ro: %s:nu se poate derepartiza(deallocate) consola %d

source: %s: cannot find any keymaps?
ro: %s: nu pot gãsi nici o mapare de taste?

source: %s: plain map not allocated? very strange ...
ro: %s: maparea simplã(plain) nealocatã? foarte ciudat ...

source: keycode range supported by kernel: 1 - %d
ro: domeniu cod de taste suportat de kernel: 1 - %d

source: max number of actions bindable to a key: %d
ro: numãr maxim de acþiuni legate(bindable) de o tastã: %d

source: number of keymaps in actual use: %d
ro: numãr de mapãri de taste în folosire actualã: %d

source: of which %d dynamically allocated
ro: din care %d alocate dinamic

source: ranges of action codes supported by kernel:
ro: interval de coduri de acþiune suportat de kernel:

source: number of function keys supported by kernel: %d
ro: numãr taste de funcþii suportat de kernel: %d.

source: max nr of compose definitions: %d
ro: nr max de definiþii compuse: %d

source: nr of compose definitions in actual use: %d
ro: nr de definiþii compuse actualmente în folosire: %d

source: Symbols recognized by %s: (numeric value, symbol)
ro: Simboluri recunoscute de %s: (valoare numericã, simbol)

source: The following synonyms are recognized:
ro: Urmãtoarele sinonime sunt recunoscute:

source: %-15s for %s
ro: %-15s pentru %s

source: Recognized modifier names and their column numbers:
ro: S-au recunoscut numele modificatorilor ºi numerele lor de coloane:

source: # not alt_is_meta: on keymap %d key %d is bound to
ro: # diferit de alt_is_meta: în maparea de taste %d tasta %d este legatã de

source: impossible: not meta?
ro: imposibil: non meta?

source: KDGKBSENT failed at index %d:
ro: eroare KDGKBSENT la indexul %d:

source: dumpkeys version %s
ro: dumpkeys versiune %s

source: usage: dumpkeys [options...] valid options are: -h --help display this help text -i --short-info display information about keyboard driver -l --long-info display above and symbols known to loadkeys -n --numeric display keytable in hexadecimal notation -f --full-table don't use short-hand notations, one row per keycode -1 --separate-lines one line per (modifier,keycode) pair --funcs-only display only the function key strings --keys-only display only key bindings --compose-only display only compose key combinations -c --charset=
ro: folosire: dumpkeys [opþiuni...] opþiuni valide: -h --help afiºeazã acest text de ajutor -i --short-info afiºeazã informaþii despre driverul de tastaturã -l --long-info afiºeazã cele de mai sus ºi simbolurile cunoscute loadkeys -n --numeric afiºeazã tabela de taste în notare hexazecimalã -f --full-table nu foloseºte notaþii scurte, ci un rând pe cod_tastã -1 --separate-lines o linie pe (modificator,cod_tastã) pereche --funcs-only afiºeazã numai ºirurile tastei de funcþii --keys-only afiºeazã numai legãturile(bindings) tastelor --compose-only afiºeazã doar combinaþiile tastelor compuse -c --charset=

source: interpret character action codes to be from the specified character set
ro: interpreteazã codurile de acþiune ale caracterelor ce vor fi luate din setul de caractere specificat

source: error executing %s
ro: eroare în executarea %s

source: usage: getkeycodes
ro: folosire: getkeycodes

source: Plain scancodes xx (hex) versus keycodes (dec)
ro: Scancodes normale(plain) xx (hex) versus keycodes (dec)

source: 0 is an error; for 1-88 (0x01-0x58) scancode equals keycode
ro: 0 este eroare; pentru 1-88 (0x01-0x58) codul de scan(scancode) egal codul tastei

source: Escaped scancodes e0 xx (hex)
ro: Coduri scanare de escape e0 xx (hex)

source: failed to get keycode for scancode 0x%x
ro: eroare în primirea codului de tastã(keycode) pentru codul de scan(scancode) 0x%x

source: kbd_mode: error reading keyboard mode
ro: kbd_mode: eroare în citirea modului tastaturii

source: The keyboard is in raw (scancode) mode
ro: Tastatura este în mod brut (scancode)

source: The keyboard is in mediumraw (keycode) mode
ro: Tastatura este în mod mediu-brut (keycode)

source: The keyboard is in the default (ASCII) mode
ro: Tastatura este în modul implicit (ASCII)

source: The keyboard is in Unicode (UTF-8) mode
ro: Tastatura este în modul Unicode (UTF-8)

source: The keyboard is in some unknown mode
ro: Tastatura este într-un mod necunoscut

source: %s: error setting keyboard mode
ro: %s: eroare în setarea modului tastaturii

source: Typematic Rate set to %.1f cps (delay = %d ms)
ro: Rata de Tipãrire(Typematic) setatã la %.1f cps (întârziere = %d ms)

source: Usage: kbdrate [-V] [-s] [-r rate] [-d delay]
ro: Folosire: kbdrate [-V] [-s] [-r ratã] [-d întârziere]

source: Cannot open /dev/port
ro: Nu se poate deschide /dev/port

source: bug: getfont called with count<256
ro: bug: getfont apelat cu numãr(count)<256

source: %s: out of memory
ro: %s: memorie plinã

source: unknown charset %s - ignoring charset request
ro: set de caractere %s necunoscut - se ignorã cererea de set de caractere

source: assuming iso-8859-1 %s
ro: se presupune iso-8859-1 %s

source: assuming iso-8859-15 %s
ro: se presupune iso-8859-15 %s

source: assuming iso-8859-2 %s
ro: se presupune iso-8859-2 %s

source: assuming iso-8859-3 %s
ro: se presupune iso-8859-3 %s

source: assuming iso-8859-4 %s
ro: se presupune iso-8859-4 %s

source: unknown keysym '%s'
ro: keysym '%s' necunoscut

source: Error writing map to file
ro: Eroare în scrierea mapãrii în fiºier

source: Bad input line: %s
ro: Linie de intrare(input) greºitã: %s

source: %s: Glyph number (0x%x) larger than font length
ro: %s: Numãrul reprezentãrii(glyph) (0x%x) mai mare decât fontul

source: %s: Bad end of range (0x%x)
ro: %s: Sfârºit de interval eronat (0x%x)

source: %s: Bad Unicode range corresponding to font position range 0x%x-0x%x
ro: %s: Interval Unicode greºit corespunzãtor intervalului de poziþie font 0x%x-0x%x

source: %s: Unicode range U+%x-U+%x not of the same length as font position range 0x%x-0x%x
ro: %s: Intervalul Unicode U+%x-U+%x nu are aceeaºi mãrime ca intervalul de poziþie al fontului 0x%x-0x%x

source: %s: trailing junk (%s) ignored
ro: %s: gunoiul(junk) de la sfârºit (%s) ignorat

source: Loading unicode map from file %s
ro: Se încarcã maparea unicode din fiºierul %s

source: %s: %s: Warning: line too long
ro: %s: %s: Avertisment: linie prea lungã

source: %s: not loading empty unimap (if you insist: use option -f to override)
ro: %s: nu s-a încãrcat unimap-ul vid (dacã inistaþi: folosiþi opþiunea -f pentru suprascriere(override))

source: entry
ro: intrare

source: entries
ro: intrãri

source: Saved unicode map on `%s'
ro: S-a salvat maparea unicode în `%s'

source: Appended Unicode map
ro: S-a adãugat(appended) maparea Unicode

source: usage: %s [-v] [-o map.orig] map-file
ro: folosire: %s [-v] [-o map.orig] fiºier-mapare

source: mapscrn: cannot open map file _%s_
ro: mapscrn: nu se poate deschide fiºierul de mapare _%s_

source: Cannot stat map file
ro: Nu se poate gãsi starea(stat) fiºierului de mapare

source: Loading binary direct-to-font screen map from file %s
ro: Se încarcã maparea de ecran binarã direct-la-font din fiºierul %s

source: Error reading map from file `%s'
ro: Eroare în citirea mapãrii din fiºierul `%s'

source: Loading binary unicode screen map from file %s
ro: Se încarcã maparea de ecran binarã unicode din fiºierul %s

source: Loading symbolic screen map from file %s
ro: Se încarcã maparea de ecran simbolicã din fiºierul %s

source: Error parsing symbolic map from `%s', line %d
ro: Eroare in analiza(parsing) mapãrii simbolice din `%s', linia `%d'

source: Cannot read console map
ro: Nu se poate citi maparea consolei

source: Saved screen map in `%s'
ro: S-a salvat maparea ecranului în `%s'

source: openvt: %s: illegal vt number
ro: openvt: %s: numãr vt ilegal

source: openvt: only root can use the -u flag.
ro: openvt: doar root-ul poate folosi marcajul(flag) -u.

source: openvt: cannot find a free vt
ro: openvt: nu pot gãsi un vt liber

source: openvt: cannot check whether vt %d is free
ro: openvt: nu pot verifica dacã vt %d este liber

source: use `openvt -f' to force.
ro: folosiþi `openvt -f' pentru a forþa.

source: openvt: vt %d is in use; command aborted
ro: openvt: vt %d este în uz; se renunþã la comandã

source: openvt: Unable to open %s: %s
ro: openvt: Nu se poate deschide %s: %s

source: openvt: Cannot open %s read/write (%s)
ro: openvt: Nu se poate deschide %s citire/scriere (%s)

source: openvt: using VT %s
ro: openvt: se foloseºte VT %s

source: openvt: Unable to set new session (%s)
ro: openvt: nu se poate seta sesiune nouã (%s)

source: openvt: could not open %s R/W (%s)
ro: openvt: nu se poate deschide %s R/W (%s)

source: openvt: could not deallocate console %d
ro: openvt: nu se poate derepartiza(deallocate) consola %d

source: %s: short ucs2 unicode table
ro: %s: tabel scurt ucs2 unicode

source: %s: short utf8 unicode table
ro: %s: tabel scurt utf8 unicode

source: %s: bad utf8
ro: %s: utf8 eronat

source: %s: unknown utf8 error
ro: %s: eroare utf8 necunoscutã

source: %s: short unicode table
ro: %s: tabel scurt unicode

source: %s: Error reading input font
ro: %s: Eroare în citirea fontului de intrare(input)

source: %s: Bad call of readpsffont
ro: %s: Apelare greºitã a readpsffont

source: %s: Unsupported psf file mode (%d)
ro: %s:Mod fiºier psf nesuportat (%d)

source: %s: Unsupported psf version (%d)
ro: %s:Versiune fiºier psf nesuportatã (%d)

source: %s: zero input font length?
ro: %s: intrare(input) zero pentru mãrime(length)?

source: %s: zero input character size?
ro: %s: intrare(input) mãrime caracter zero?

source: %s: Input file: bad input length (%d)
ro: %s: Fiºier intrare(input): mãrime intrare(input) eronatã (%d)

source: %s: Input file: trailing garbage
ro: %s: Fiºier intrare(input): gunoi(garbage) la sfârºit

source: appendunicode: illegal unicode %u
ro: appendunicode: unicode ilegal %u

source: Cannot write font file header
ro: Nu se poate scrie header-ul fiºierului de font

source: Cannot write font file
ro: Nu se poate scrie fiºierul de font

source: %s: Warning: line too long
ro: %s: Avertisment: linie prea lungã

source: %s: Bad input line: %s
ro: %s: Linie de intrare(input) greºitã: %s

source: %s: Glyph number (0x%lx) past end of font
ro: %s: Numãrul reprezentãrii(glyph) (0x%lx) a depãºit sfârºitul fontului

source: %s: Bad end of range (0x%lx)
ro: %s: Sfârºit de domeniu(range) eronat (0x%lx)

source: %s: Corresponding to a range of font positions, there should be a Unicode range
ro: %s: Corespunzãtor unui interval de poziþii de fonturi, ar trebui sã fie un interval (range) Unicode

source: Usage: %s infont intable outfont
ro: Folosire: %s infont intable outfont

source: Usage: %s infont [outtable]
ro: Folosire: %s infont [outtable]

source: Usage: %s infont outfont
ro: Folosire: %s infont outfont

source: Usage: %s [-i infont] [-o outfont] [-it intable] [-ot outtable] [-nt]
ro: Folosire: %s [-i infont] [-o outfont] [-it intable] [-ot outtable] [-nt]

source: %s: Bad magic number on %s
ro: %s: Numãr magic greºit în cazul %s

source: %s: psf file with unknown magic
ro: %s: fiºier psf cu numãr magic necunoscut

source: %s: input font does not have an index
ro: %s: fontul de intrare(input) nu are un index

source: resizecons: cannot find videomode file %s
ro: resizecons: nu se poate gãsi fiºierul de moduri video %s

source: Invalid number of lines
ro: Numãr de linii invalid

source: Old mode: %dx%d New mode: %dx%d
ro: Mod vechi: %dx%d Mod nou: %dx%d

source: Old #scanlines: %d New #scanlines: %d Character height: %d
ro: Vechi #liniiscan: %d Nou #liniiscan: %d Înãlþime caracter: %d

source: resizecons: the command `%s' failed
ro: resizecons: comanda `%s' a eºuat

source: resizecons: don't forget to change TERM (maybe to con%dx%d or linux-%dx%d)
ro: resizecons: nu uitaþi sã schimbaþi TERM (poate în con%dx%d sau în linux-%dx%d)

source: resizecons: call is: resizecons COLSxROWS or: resizecons COLS ROWS or: resizecons -lines ROWS, with ROWS one of 25, 28, 30, 34, 36, 40, 44, 50, 60
ro: resizecons: apelarea este: resizecons COLOANExRÂNDURI sau: resizecons COLOANEx RÂNDURI sau: resizecons -lines RÂDURI, cu RÂNDURI unul din numerele 25, 28, 30, 34, 36, 40, 44, 50, 60

source: resizecons: cannot get I/O permissions.
ro: resizecons: nu se pot primi(get) permisiile I/O.

source: usage: screendump [n]
ro: folosire: screendump [n]

source: Error reading %s
ro: Eroare în citirea %s

source: couldn't read %s, and cannot ioctl dump
ro: nu s-a putut citi %s, ºi nu se poate face dump ioctl

source: couldn't read %s
ro: nu s-a putut citi %s

source: Strange ... screen is both %dx%d and %dx%d ??
ro: Ciudat ... ecranul este ºi %dx%d ºi %dx%d ??

source: Error writing screendump
ro: Eroare în scrierea dump-ului de ecran

source: setfont: too many input files
ro: setfont: prea multe fiºiere de intrare(input)

source: setfont: cannot both restore from character ROM and from file. Font unchanged.
ro: setfont: nu se poate reveni(restore) ºi din caracterul ROM ºi din fiºier. Font neschimbat.

source: Bad character height %d
ro: Înãlþime de caracter greºitã: %d

source: Bad character width %d
ro: Lãþime de caracter greºitã: %d

source: %s: font position 32 is nonblank
ro: %s: poziþia font 32 este nonblank

source: %s: wiped it
ro: %s: a fost ºters(wiped)

source: %s: background will look funny
ro: %s: fundalul va arãta nostim

source: Loading %d-char %dx%d font from file %s
ro: Se încarcã %d-char fontul %dx%d din fiºierul %s

source: Loading %d-char %dx%d font
ro: Se încarcã %d-char fontul %dx%d

source: Loading %d-char %dx%d (%d) font from file %s
ro: Se încarcã %d-char fontul %dx%d(%d) din fiºierul %s

source: Loading %d-char %dx%d (%d) font
ro: Se încarcã %d-char fontul %dx%d(%d)

source: %s: bug in do_loadtable
ro: %s: bug în do_loadtable

source: Loading Unicode mapping table...
ro: Se încarcã tabela de mapare Unicode...

source: Cannot open font file %s
ro: Nu se poate deschide fiºierul de font %s

source: When loading several fonts, all must be psf fonts - %s isn't
ro: Când se încarcã mai multe fonturi, toate trebuie sã fie fonturi psf. - %s nu este

source: Read %d-char %dx%d font from file %s
ro: S-a citit %d-char fontul %dx%d din fiºierul %s

source: When loading several fonts, all must have the same height
ro: Când se încarcã mai multe fonturi, toate trebuie sã aibã aceeaºi înãlþime

source: When loading several fonts, all must have the same width
ro: Când se încarcã mai multe fonturi, toate trebuie sã aibã aceeaºi lãþime

source: Cannot find default font
ro: Nu se poate gãsi fontul implicit

source: Cannot find %s font
ro: Nu se poate gãsi fontul %s

source: Reading font file %s
ro: Se citeºte fiºierul de font %s

source: No final newline in combine file
ro: Nu existã marcaj_linie_nouã(newline) final în fiºierul combinat

source: Too many files to combine
ro: Prea multe fiºiere de combinat

source: Hmm - a font from restorefont? Using the first half.
ro: Hmm - un font din restorefont? Se foloseºte prima jumãtate.

source: Bad input file size
ro: Mãrime fiºier intrare(input) invalidã

source: This file contains 3 fonts: 8x8, 8x14 and 8x16. Please indicate using an option -8 or -14 or -16 which one you want loaded.
ro: Acest fiºier conþine 3 fonturi: 8x8, 8x14 ºi 8x16. Vã rugãm indicaþi folosind o opþiune -8 or -14 or -16 pentru a-l selecta pe cel dorit.

source: You asked for font size %d, but only 8, 14, 16 are possible here.
ro: Aþi cerut o mãrime de font %d, dar doar 8, 14, 16 sunt posibile aici.

source: Found nothing to save
ro: Nu am gãsit nimic de salvat

source: Saved %d-char %dx%d font file on %s
ro: S-a salvat fiºierul %d-char fontul %dx%d în %s

source: usage: setkeycode scancode keycode ... (where scancode is either xx or e0xx, given in hexadecimal, and keycode is given in decimal)
ro: folosire: setkeycode scancode keycode ... (unde scancode este fie xx sau e0xx, dat în hexazecimal, ºi keycode este dat în zecimal)

source: even number of arguments expected
ro: numãr par de argumente aºteptat

source: error reading scancode
ro: eroare în citirea codului de scan(scancode)

source: code outside bounds
ro: cod în afara limitelor(bounds)

source: failed to set scancode %x to keycode %d
ro: eroare în setarea scancode %x în keycode %d

source: Usage: setleds [-v] [-L] [-D] [-F] [[+|-][ num | caps | scroll %s]] Thus, setleds +caps -num will set CapsLock, clear NumLock and leave ScrollLock unchanged. The settings before and after the change (if any) are reported when the -v option is given or when no change is requested. Normally, setleds influences the vt flag settings (and these are usually reflected in the leds). With -L, setleds only sets the leds, and leaves the flags alone. With -D, setleds sets both the flags and the default flags, so that a subsequent reset will not change the flags.
ro: Folosire: setleds [-v] [-L] [-D] [-F] [[+|-][ num | caps | scroll %s]] Astfel, setleds +caps -num va seta CapsLock, ºterge NumLock ºi va lãsa ScrollLock neschimbat. Setãrile de dinainte ºi de dupã schimbare(dacã existã) sunt raportate când opþiunea -v este furnizatã sau când nu este cerutã nici o schimbare. În mod normal, setleds influenþeazã setãrile marcajului(flag) vt (ºi acestea sunt de obicei reflectate în leduri). Cu -L, setleds doar va seta ledurile, nechimbând marcajele(flag). Cu -D, setleds seteazã atât marcajele(flags), cât ºi marcajele implicite, pentru ca o resetare ulterioarã nu va schimba marcajele.

source: on
ro: activat(on)

source: off
ro: dezactivat(off)

source: Error reading current led setting. Maybe stdin is not a VT?
ro: Eroare în citirea setãrilor curente ale ledului. E posibil ca stdin sã nu fie un VT?

source: Error reading current flags setting. Maybe you are not on the console?
ro: Eroare în citirea setãrilor marcajelor(flags) curente. Poate nu sunteþi în consolã?

source: Error reading current led setting from /dev/kbd.
ro: Eroare în citirea setãrii curente a ledului din /dev/kbd.

source: KIOCGLED unavailable?
ro: KIOCGLED indisponibil?

source: KIOCSLED unavailable?
ro: KIOCSLED indisponibil?

source: Error opening /dev/kbd.
ro: Eroare în deschiderea /dev/kbd.

source: Error resetting ledmode
ro: Eroare în resetarea modurilor ledului

source: Current default flags:
ro: Marcajele(flags) implicite curente:

source: Current flags:
ro: Marcajele(flags) curente:

source: Current leds:
ro: Leduri curente:

source: unrecognized argument: _%s_
ro: argument necunoscut: _%s_

source: Old default flags:
ro: Marcaje(flags) implicite vechi:

source: New default flags:
ro: Marcaje(flags) implicite noi:

source: Old flags:
ro: Marcaje(flags) vechi:

source: New flags:
ro: Marcaje(flags) noi:

source: Old leds:
ro: Leduri vechi:

source: New leds:
ro: Leduri noi:

source: Usage: setmetamode [ metabit | meta | bit | escprefix | esc | prefix ] Each vt has his own copy of this bit. Use setmetamode [arg] < /dev/ttyn to change the settings of another vt. The setting before and after the change are reported.
ro: Folosire: setmetamode [ metabit | meta | bit | escprefix | esc | prefix ] Fiecare vt are propria copie a acestui bit. Folosiþi setmetamode [arg] < /dev/ttyn pentru a schimba setãrile altui vt. Setãrile de dinainte ºi de dupã schimbãri sunt raportate.

source: Meta key sets high order bit
ro: Tasta Meta seteazã bitul de ordine înaltã

source: Meta key gives Esc prefix
ro: Tasta Meta furnizeazã prefix Esc

source: Strange mode for Meta key?
ro: Mod ciudat pentru tasta Meta?

source: Error reading current setting. Maybe stdin is not a VT?
ro: Eroare în citirea setãrii curente. E posibil ca stdin sã nu fie un VT?

source: old state:
ro: stare veche:

source: new state:
ro: stare nouã:

source: usage: %s
ro: folosire: %s

source: failed to restore original translation table
ro: eroare în restaurarea(restore) tabelei de traduceri originale

source: failed to restore original unimap
ro: eroare în restaurarea unimap-ului original

source: cannot change translation table
ro: nu se poate schimba tabela de traduceri

source: %s: out of memory?
ro: %s: memorie plinã?

source: ?UNKNOWN?
ro: ?NECUNOSCUT?

source: kb mode was %s
ro: modul kb a fost %s

source: [ if you are trying this under X, it might not work since the X server is also reading /dev/console ]
ro: [ Dacã încercaþi asta sub X, s-ar putea sã nu funcþioneze atâta timp cât ºi serverul X citeºte /dev/console ]

source: caught signal %d, cleaning up...
ro: s-a primit semnal %d, se face curãþenie...

source: showkey version %s usage: showkey [options...] valid options are: -h --help display this help text -a --ascii display the decimal/octal/hex values of the keys -s --scancodes display only the raw scan-codes -k --keycodes display only the interpreted keycodes (default)
ro: showkey versiunea %s folosire: showkey [opþiune ...] opþiuni valide: -h --help afiºeazã acest text de ajutor -a --ascii afiºeazã valorile zecimale/octale/hexazecimale ale tastelor -s --scancodes afiºeazã doar codurile de scanare brute(raw) -k --keycodes afiºeazã doar codurile de taste interpretate(implicit)

source: Press any keys - Ctrl-D will terminate this program
ro: Apãsaþi orice taste - Ctrl-D va termina acest program

source: press any key (program terminates 10s after last keypress)...
ro: aspãsaþi orice tastã (programul se terminã la 10s dupã ultima apãsare de tastã)...

source: release
ro: eliberare

source: press
ro: apãsare

source: keycode %3d %s
ro: cod tastã %3d %s

source: %s from %s
ro: %s din %s
